docs: README - ASCII図をMermaidに変換
